kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
  // Append TIME if enabled
  if(INCLUDE_TIME) {
    n = snprintf(&user_string[offset], remaining,
             "%s/TIM%02d%02d%02d%02d%02d%02d%04d",
             (offset > 0) ? "" : "",
             now.hours, now.minutes, now.seconds,
             now.day, now.date, now.month, now.year);

    if (n > 0 && (size_t)n < remaining) {
      offset += (size_t)n;
      remaining -= (size_t)n;
    }
  }

  // Final input string to be encoded
  input_string = user_string;
}

// Function to generate sine wave lookup table for 21kHz
void get_sineval_21k(void) {
  for (int i = 0; i < MAX_SAMPLES_LOW; i++) {
    sine_val_21k[i] = (uint16_t)((4095.0 / 2.0) *
                                 (1.0 + sinf(2.0 * pi * i / MAX_SAMPLES_LOW)));
  }
}

// Function to generate sine wave lookup table for 22kHz
void get_sineval_22k(void) {
  for (int i = 0; i < MAX_SAMPLES_HIGH; i++) {
    sine_val_22k[i] = (uint16_t)((4095.0 / 2.0) *
                                 (1.0 + sinf(2.0 * pi * i / MAX_SAMPLES_HIGH)));
  }
}

// Function to generate mid-scale lookup table
void get_dc_mid(void) {
  for (int i = 0; i < MAX_SAMPLES_MID_VAL; ++i)
    dc_mid[i] = MID_12B;
}



// Function to calculate the total time it takes to send the bitstream
void calculate_pulse_time(void) {
  float f_0 = 1000000.0f / (float)MAX_SAMPLES_LOW;  // Low freq, e.g., 21kHz
  float f_1 = 1000000.0f / (float)MAX_SAMPLES_HIGH; // High freq, e.g., 22kHz

  // Exact bitstream time
  total_time = 0.0f;
  for (int i = 0; i < BITSTREAM_LENGTH; ++i) {
    if (bitstream[i] == 0) {
      total_time += ((float)PERIODS_PER_BIT_LOW) / f_0;
    } else if (bitstream[i] == 1) {
      total_time += (float)PERIODS_PER_BIT_HIGH / f_1;
    }
  }

  // Add some margin for safety
  total_time *= 1.10f;

  // Convert to ticks using the PSC already set for TIM8
  uint32_t tim8_clk = HAL_RCC_GetPCLK2Freq();
  if ((RCC->CFGR & RCC_CFGR_PPRE2) != RCC_CFGR_PPRE2_DIV1)
    tim8_clk *= 2U;
  tick_hz = (double)tim8_clk / (double)(htim8.Init.Prescaler + 1U);

  arr = __HAL_TIM_GET_AUTORELOAD(&htim8);
  ticks = (uint32_t)llround(total_time * tick_hz);

  pulse_time = ticks;
  __HAL_TIM_SET_COMPARE(&htim8, TIM_CHANNEL_1, pulse_time);
}

// Function to fill a buffer with repeated patterns from a lookup table
static inline void fill_lut_repeated(uint16_t *dst, size_t buffer_len,
                                     const uint16_t *lut, size_t lut_len) {
  size_t k = 0;
  while (k < buffer_len) {
    size_t to_copy = (buffer_len - k < lut_len) ? (buffer_len - k) : lut_len;
    memcpy(&dst[k], lut, to_copy * sizeof(uint16_t));
    k += to_copy;
  }
}

// Function to fill half of the output buffer based on the current bit
static inline void fill_half(uint16_t *dst, uint32_t bit) {
  if (bit == 2) {
    for (size_t i = 0; i < MAX_NUM_SAMPLES_BUFFER; ++i)
      dst[i] = MID_12B;
  } else if (bit == 1) {
    fill_lut_repeated(dst, MAX_NUM_SAMPLES_BUFFER, sine_val_22k,
                      MAX_SAMPLES_HIGH); // 16×
  } else {
    fill_lut_repeated(dst, MAX_NUM_SAMPLES_BUFFER, sine_val_21k,
                      MAX_SAMPLES_LOW); // 15×
  }
}

// DAC conversion complete callbacks for half buffer
void HAL_DAC_ConvHalfCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  // Update current period
  uint32_t per = (current_bit == 0)   ? PER_HALF_LOW
                 : (current_bit == 1) ? PER_HALF_HIGH
                                      : PER_HALF_SIL;

  current_period += per;

  // Check if we need to move to the next bit
  while ((current_bit == 0 && current_period >= PERIODS_PER_BIT_LOW) ||
         (current_bit == 1 && current_period >= PERIODS_PER_BIT_HIGH) ||
         (current_bit == 2 && current_period >= PERIODS_PER_BIT_SIL)) {
    current_period = 0;
    current_idx = (current_idx + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_idx];
  }

  // Fill the first half of the buffer based on the current bit
  fill_half((uint16_t *)&output_buffer[0], current_bit);
}

// DAC conversion complete callback for the full buffer
void HAL_DAC_ConvCpltCallbackCh1(DAC_HandleTypeDef *hdac) {
  if (!tx_active)
    return;

  // Update current period
  uint32_t per = (current_bit == 0)   ? PER_HALF_LOW
                 : (current_bit == 1) ? PER_HALF_HIGH
                                      : PER_HALF_SIL;

  current_period += per;

  // Check if we need to move to the next bit
  while ((current_bit == 0 && current_period >= PERIODS_PER_BIT_LOW) ||
         (current_bit == 1 && current_period >= PERIODS_PER_BIT_HIGH) ||
         (current_bit == 2 && current_period >= PERIODS_PER_BIT_SIL)) {
    current_period = 0;
    current_idx = (current_idx + 1) % BITSTREAM_LENGTH;
    current_bit = bitstream[current_idx];
  }

  // Fill the first half of the buffer based on the current bit
  fill_half((uint16_t *)&output_buffer[MAX_NUM_SAMPLES_BUFFER], current_bit);
}

void reset_dac(void) {
  // Stop DAC DMA
  HAL_DAC_Stop_DMA(&hdac1, DAC_CHANNEL_1);

  // Restart the bitstream from the beginning
  current_idx = 0;
  current_period = 0;
  current_bit = bitstream[0];

  // Prefill both halves of the circular buffer with the first bit
  fill_half((uint16_t *)&output_buffer[0], current_bit);
  fill_half((uint16_t *)&output_buffer[MAX_NUM_SAMPLES_BUFFER], current_bit);

  __HAL_TIM_SET_COUNTER(&htim2, 0);
  HAL_TIM_Base_Start(&htim2);
  tx_active = true;

  // Restart DAC with the circular buffer
  HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_1, (uint32_t *)output_buffer,
                    2 * MAX_NUM_SAMPLES_BUFFER, DAC_ALIGN_12B_R);
}

int counter = 0;
// Timer interrupt callback for TIM8
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM8) {

    if (USE_MINUTES_INSTEAD_OF_SECONDS &&
        !USE_DEFAULT_INTERVAL_BETWEEN_REPEATS) {

      counter++;
      if (counter >= INTERVAL_BETWEEN_REPEATS_MINUTES) {
        counter = 0;
        HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
        update_time_temperature();
        update_input_string();
        reset_dac();
      }

    } else {
      HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
      update_time_temperature();
      update_input_string();
      reset_dac();
    }
  }
}

void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM8 && htim->Channel == HAL_TIM_ACTIVE_CHANNEL_1) {
    // if (tx_active) {
    HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
    // }
    tx_active = false;
    HAL_TIM_Base_Stop(&htim2); // optional: stop TIM2 base to save a few µA

    // Optional: force output to mid-scale (normally not needed because your
    // frame ends with 'silence')
    HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, MID_12B);
  }
}

static void I2C_Scan(I2C_HandleTypeDef *hi2c, char *out, size_t out_len) {
    size_t offset = 0;
    size_t remaining = out_len;

    for (uint8_t addr = 1; addr < 127; addr++) {
        if (HAL_I2C_IsDeviceReady(hi2c, addr << 1, 1, 10) == HAL_OK) {
            int n = snprintf(&out[offset], remaining, "0x%02X ", addr);
            if (n > 0 && (size_t)n < remaining) {
                offset += (size_t)n;
                remaining -= (size_t)n;
            }
        }
    }

    // Null-terminate
    if (remaining > 0) {
        out[offset] = '\0';
    }
}

